server/src/tests/performanceTest/shelterTest/basic-load.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 30
      arrivalRate: 1
      name: "Warm up"
    - duration: 60
      arrivalRate: 1
      name: "Normal load"
    - duration: 30
      arrivalRate: 1
      name: "Cool down"
  defaults:
    headers:
      Content-Type: "application/json"
  timeout: 30
  payload:
    path: "shelter-test-users.csv"
    fields:
      - "email"
      - "password"

scenarios:
  - name: "Login Admin"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200

  - name: "Create Shelter"
    weight: 20
    flow:
      - post:
          url: "/api/shelters/create"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "Test Shelter {{ $randomString() }}"
            description: "Performance test shelter created during load testing"
            shelterType: "TEMPORARY"
            address:
              street: "123 Performance Test Street"
              city: "Colombo"
              province: "Western"
              postalCode: "00100"
            contact:
              phone: "+94770000000"
              email: "test{{ $randomString() }}@rescuenet.lk"
            location:
              type: "Point"
              coordinates: [79.8612, 6.9876]
            capacity:
              total: 50
            supports:
              disasterTypes: ["FLOOD"]
              wheelchairAccess: true
              medicalSupport: false
              foodSupport: true
          expect:
            - statusCode: 201

  - name: "Get Shelter List"
    weight: 40
    flow:
      - get:
          url: "/api/shelters/get-list?page=1&limit=20"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  - name: "Get Shelter by ID"
    weight: 15
    flow:
      - get:
          url: "/api/shelters/get-list?page=1&limit=1"
          headers:
            Authorization: "Bearer {{ authToken }}"
          capture:
            - json: "$.shelters[0]._id"
              as: "shelterId"
          expect:
            - statusCode: 200
      - get:
          url: "/api/shelters/get/{{ shelterId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  - name: "Get Nearby Shelters"
    weight: 15
    flow:
      - get:
          url: "/api/shelters/get-nearby?lng=79.8612&lat=6.9876&radiusKm=5"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200