server/src/tests/performanceTest/shelterTest/stress-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 60
      arrivalRate: 1
      name: "Baseline"
    - duration: 90
      arrivalRate: 1
      name: "Medium stress"
    - duration: 120
      arrivalRate: 1
      name: "High stress"
    - duration: 90
      arrivalRate: 1
      name: "Maximum stress"
    - duration: 60
      arrivalRate: 1
      name: "Recovery"
  defaults:
    headers:
      Content-Type: "application/json"
  timeout: 60
  payload:
    path: "shelter-test-users.csv"
    fields:
      - "email"
      - "password"

scenarios:
  - name: "Login and Create Shelter"
    weight: 20
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      - post:
          url: "/api/shelters/create"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            name: "Stress Shelter {{ $randomString() }}"
            description: "High volume shelter creation test during stress testing"
            shelterType: "TEMPORARY"
            address:
              street: "456 Performance Test Avenue"
              city: "Colombo"
              province: "Western"
              postalCode: "00100"
            contact:
              phone: "+94770000001"
              email: "stress{{ $randomString() }}@rescuenet.lk"
            location:
              type: "Point"
              coordinates: [79.8612, 6.9876]
            capacity:
              total: 50
            supports:
              disasterTypes: ["FLOOD"]
              wheelchairAccess: false
              medicalSupport: true
              foodSupport: true
          expect:
            - statusCode: 201

  - name: "Login and List Shelters"
    weight: 55
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      - get:
          url: "/api/shelters/get-list?page=1&limit=50"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200

  - name: "Login and Nearby Search"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "authToken"
          expect:
            - statusCode: 200
      - get:
          url: "/api/shelters/get-nearby?lng=79.8612&lat=6.9876&radiusKm=10"
          headers:
            Authorization: "Bearer {{ authToken }}"
          expect:
            - statusCode: 200